DataProcessors/мегапрайсПростойОбменПрайсом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<DataProcessor>
		<Properties>
			<Name>мегапрайсПростойОбменПрайсом</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидЦеныНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрофильПрайсЛиста</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.мегапрайсПрофилиПрайсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоискПоКоду</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоискПоАртикулу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоискПоНаименованию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоискПоНоменклатуреПоставщиков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздаватьСклады</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомпоновщикНастроек</Name>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьХарактеристикиНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьБитрикс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТабличнаяЧасть</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле_Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле_Артикул</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле_Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле_Характеристика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле_ID_Склад</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле_Склад</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле_Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле_Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле_Родитель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураПоставщика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатураПоставщиков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/мегапрайсЦеныНоменклатурыПоставщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>мегапрайсЦеныНоменклатурыПоставщиков</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаПродажи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МинимальныйЗаказ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокПоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПрайсПартнера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.мегапрайсПрофилиПрайсов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатураПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураПоставщиков</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поле_Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поле_Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поле_Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/мегапрайсПростойОбменПрайсом/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СхемаКомпоновкиДанных = РеквизитФормыВЗначение("Объект").ПолучитьМакет("СхемаЗапроса");
	URLСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор());
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(URLСхемы);
	Объект.КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
	Объект.КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);

КонецПроцедуры

 &НаКлиенте
 Процедура ФайлКаталогНаЛокальномДискеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	 
	 СтандартнаяОбработка = Ложь;
	 
	 ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	 ДиалогОткрытияФайла.Заголовок = НСтр("ru = 'Выберите путь'");
	 
	 ДиалогОткрытияФайла.Показать(Новый ОписаниеОповещения("ФайлКаталогНаЛокальномДискеНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("ДиалогОткрытияФайла", ДиалогОткрытияФайла)));		
	 
 КонецПроцедуры
 
 &НаКлиенте
 Процедура ФайлКаталогНаЛокальномДискеНачалоВыбораЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	 
	 ДиалогОткрытияФайла = ДополнительныеПараметры.ДиалогОткрытияФайла;
	 	 
	 Если (ВыбранныеФайлы <> Неопределено) Тогда
		 Объект.ПутьКФайлу = ДиалогОткрытияФайла.Каталог;
	 КонецЕсли;

КонецПроцедуры


&НаСервере
Процедура ВыгрузитьНаСервере()
	
	ОбработкаОбъект =  РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.СформироватьВыгрузку();
		
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	
	ВыгрузитьНаСервере();
	Сообщить("Выгрузка успешно завершена.");
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере()
	
	Объект.ТабличнаяЧасть.Очистить();
	
	ТекстовыйФайл = Новый ЧтениеТекста(Объект.ПутьКФайлу+"\megaprice_export.csv",КодировкаТекста.ANSI);            
	ВыборкаСтрока =  ТекстовыйФайл.ПрочитатьСтроку();
	
	Пока ВыборкаСтрока <> Неопределено Цикл // строки читаются до символа перевода строки
		
		//Сообщить(ВыборкаСтрока);
		ВыборкаСтрока =  ТекстовыйФайл.ПрочитатьСтроку();
		Если ПустаяСтрока(ВыборкаСтрока) Тогда
			Продолжить;
		КонецЕсли;
		
		Массив = СтрРазделить(ВыборкаСтрока,";");
		НоваяСтрока = Объект.ТабличнаяЧасть.Добавить();
		НоваяСтрока.Поле_Код = Массив.Получить(0);
		НоваяСтрока.Поле_Артикул = Массив.Получить(1);
		НоваяСтрока.Поле_Наименование = Массив.Получить(2);
		НоваяСтрока.Поле_Характеристика = Массив.Получить(3);
		НоваяСтрока.Поле_Склад = Массив.Получить(4);
		НоваяСтрока.Поле_Количество = Массив.Получить(5);
		НоваяСтрока.Поле_Цена = Массив.Получить(6);
		
	КонецЦикла;	
	
	ТекстовыйФайл.Закрыть(); 		
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	ЗагрузитьНаСервере();
	Сообщить("Загрузка успешно завершена.");
	
КонецПроцедуры

&НаСервере
Процедура СинхронизироватьНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.мСинхронизироватьСервер();	
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");

	Для Каждого ВыборкаСтрока ИЗ Объект.ТабличнаяЧасть Цикл
		
		Если НЕ ПустаяСтрока(ВыборкаСтрока.Поле_Склад) Тогда
			НайтиСклад = Справочники.Склады.НайтиПоНаименованию(ВыборкаСтрока.Поле_Склад);
			Если НайтиСклад = Справочники.Склады.ПустаяСсылка() Тогда
				НайтиСклад = Справочники.Склады.СоздатьЭлемент();
				НайтиСклад.Наименование = ВыборкаСтрока.Поле_Склад;
				НайтиСклад.Записать();
			КонецЕсли;
			ВыборкаСтрока.Склад = НайтиСклад.Ссылка;
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(ВыборкаСтрока.Поле_Характеристика) Тогда
			ВыборкаСтрока.Характеристика = Справочники.ХарактеристикиНоменклатуры.НайтиПоНаименованию(ВыборкаСтрока.Поле_Характеристика,,,ВыборкаСтрока.Номенклатура);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Синхронизировать(Команда)
	
	СинхронизироватьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура МегапрайсРегистрацияНаСервере()
	
	
	Если НЕ ЗначениеЗаполнено(Объект.ПрофильПрайсЛиста) Тогда
		Сообщить("Не выбран профиль прайса поставщика");
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.мегапрайсЦеныНоменклатурыПоставщиков.УдалитьПрайсЛист(Объект.ПрофильПрайсЛиста);
	
	ПустаяСсылка  = Справочники.Номенклатура.ПустаяСсылка();
		
	НаборЗаписей = РегистрыСведений.мегапрайсЦеныНоменклатурыПоставщиков.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПрайсПартнера.Установить(Объект.ПрофильПрайсЛиста);
	
	МаксСтрокЗапись = 10000;
	КолОбработанныхСтрок = 0;
	Для Каждого Стр из Объект.ТабличнаяЧасть Цикл			
		КолОбработанныхСтрок = КолОбработанныхСтрок +1;
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период        = ТекущаяДата();	
		НоваяЗапись.КлючСтроки    = Стр.НомерСтроки;
		НоваяЗапись.ПрайсПартнера = Объект.ПрофильПрайсЛиста;
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Стр);
		НоваяЗапись.Количество   = Стр.Поле_Количество;	
		НоваяЗапись.Валюта       = "";			
		НоваяЗапись.Цена         = 0;
		НоваяЗапись.ЦенаПродажи  = Стр.Поле_Цена;	
		НоваяЗапись.МинимальныйЗаказ  = 0;	
		//Если КолОбработанныхСтрок = 20000 Тогда
		//	//НаборЗаписей.ОбменДанными.Загрузка = Истина;
		//	НаборЗаписей.Записать(Ложь);
		//	НаборЗаписей.Очистить();
		//	КолОбработанныхСтрок = 0;
		//КонецЕсли;
	КонецЦикла;
	
	Если НаборЗаписей.Количество() > 0 Тогда
		НаборЗаписей.Записать(Истина);
	КонецЕсли;
	
	//ТекстСОобщения = "Прайс загружен (вручную). - "+ПрайсПартнера+"  идентификатор прайса - "+ИдентификаторПрайса;
	//СообщениеВЖурнал(ТекстСОобщения);
	//Если НЕ ЗагруженРоботом Тогда
	//	мегапрайсЗаписатьСобытиеВЖурнал(ПрайсПартнера,ТекстСОобщения);	
	//КонецЕсли;
	
	//ПрофильОбъект = ПрайсПартнера.ПолучитьОбъект();
	//ПрофильОбъект.ИдентификаторПрайса = ИдентификаторПрайса;
	//ПрофильОбъект.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура МегапрайсРегистрация(Команда)
	
	МегапрайсРегистрацияНаСервере();
	
КонецПроцедуры
